# EavesAreAligned Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DetailFailures..::..EavesAreAligned Property
BuiltInFailures..::..DetailFailures Class See Also
---
All eaves are already aligned.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId EavesAreAligned { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property EavesAreAligned As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ EavesAreAligned {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DetailFailures Class
Autodesk.Revit.DB Namespace